// 변수, 상수 작성 과제
let favoritemovie = '윤희에게'
const LIGHTSPEED = '299,792,458 m/s'
let is_complete_email_valificaiton = true
let productInventory = 47 + '개'
let memberPoint = 15_8000 + '점'
const APIBASICSEVER = 'https://api.example.com'
let postView = 1_234
let deliveryStatus = '배송중'
let can_use_coupon = true
const MAXIMUMUPLOADFILESIZE =  10485760
let UserRatingScore = parseFloat(85.5) + '점'
let agree_receive_notifications = true

//함수 작성 과제
//--------------------------------------------------------------------------------------------------------------------------------------------------------------
//1번 환영 메시지 생성
function welconeMessage (name, membershipScore){
  // 일반 회원 환영 메시지 반환문 작성
  //return '안녕하세요,' + name + '님!' + ' 즐거운 쇼핑되세요.'
  // 삼항 연산자를 활용하여 변수 선언 
  // 멤버십 등급 매개변수에 따라서 Vip를 참으로 기준하여, 삼항 연산자 사용
  const message = membershipScore === 'VIP' ?  '🌟 VIP ' + name + '님, ' + '특별한 혜택이 준비되어 있습니다!': '안녕하세요,' + name + '님!' + ' 즐거운 쇼핑되세요.'
  return message
}
console.log(welconeMessage('예지', 'VIP'))
console.log(welconeMessage('예지', 'basic'))


//--------------------------------------------------------------------------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------------------------------------------------------------------------
